khosta77/stm32f4_I2C_SSD1306/src/SH_DMA_Sx.h
#ifndef STEPAN_HAL_DMA_STREAMX_H_
#define STEPAN_HAL_DMA_STREAMX_H_

#include "../system/include/cmsis/stm32f4xx.h"

uint8_t _dmax_irq_status[16] = { 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
                                 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };

#define DMAx_IRQ_STATUS_TCIF  0b00000001  // Полная передача
#define DMAx_IRQ_STATUS_HTIF  0b00000010  // Половина передачи
#define DMAx_IRQ_STATUS_TEIF  0b00000100  // Ошибка передачи
#define DMAx_IRQ_STATUS_DMEIF 0b00001000  // Ошибка direct-режима
#define DMAx_IRQ_STATUS_FEIF  0b00010000  // Ошибка FIFO
#define DMAx_IRQ_STATUS_CT    0b10000000  // Массив 1 или 0

void DMA1_Stream0_IRQHandler(void) {
    if ((DMA1->LISR & DMA_LISR_TCIF0) == DMA_LISR_TCIF0) {  // Полная передача
        _dmax_irq_status[0] &= ~DMAx_IRQ_STATUS_TCIF;
        DMA1_Stream0->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CTCIF0;
    }

    if ((DMA1->LISR & DMA_LISR_HTIF0) == DMA_LISR_HTIF0) {  // Половина передачи
        _dmax_irq_status[0] &= ~DMAx_IRQ_STATUS_HTIF;
        DMA1_Stream0->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CHTIF0;
    }

    if ((DMA1->LISR & DMA_LISR_TEIF0) == DMA_LISR_TEIF0) {  // Ошибка передачи
        _dmax_irq_status[0] &= ~DMAx_IRQ_STATUS_TEIF;
        DMA1_Stream0->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CTEIF0;
    }

    if ((DMA1->LISR & DMA_LISR_DMEIF0) == DMA_LISR_DMEIF0) {  // Ошибка direct-режима
        _dmax_irq_status[0] &= ~DMAx_IRQ_STATUS_DMEIF;
        DMA1_Stream0->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CDMEIF0;
    }

    if ((DMA1->LISR & DMA_LISR_FEIF0) == DMA_LISR_FEIF0) {  // Ошибка FIFO
        _dmax_irq_status[0] &= ~DMAx_IRQ_STATUS_FEIF;
        DMA1_Stream0->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CFEIF0;
    }
}

void DMA1_Stream1_IRQHandler(void) {
    if ((DMA1->LISR & DMA_LISR_TCIF1) == DMA_LISR_TCIF1) {  // Полная передача
        _dmax_irq_status[1] &= ~DMAx_IRQ_STATUS_TCIF;
        DMA1_Stream1->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CTCIF1;
    }

    if ((DMA1->LISR & DMA_LISR_HTIF1) == DMA_LISR_HTIF1) {  // Половина передачи
        _dmax_irq_status[1] &= ~DMAx_IRQ_STATUS_HTIF;
        DMA1_Stream1->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CHTIF1;
    }

    if ((DMA1->LISR & DMA_LISR_TEIF1) == DMA_LISR_TEIF1) {  // Ошибка передачи
        _dmax_irq_status[1] &= ~DMAx_IRQ_STATUS_TEIF;
        DMA1_Stream1->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CTEIF1;
    }

    if ((DMA1->LISR & DMA_LISR_DMEIF1) == DMA_LISR_DMEIF1) {  // Ошибка direct-режима
        _dmax_irq_status[1] &= ~DMAx_IRQ_STATUS_DMEIF;
        DMA1_Stream1->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CDMEIF0;
    }

    if ((DMA1->LISR & DMA_LISR_FEIF1) == DMA_LISR_FEIF1) {  // Ошибка FIFO
        _dmax_irq_status[1] &= ~DMAx_IRQ_STATUS_FEIF;
        DMA1_Stream1->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CFEIF1;
    }
}

void DMA1_Stream2_IRQHandler(void) {
    if ((DMA1->LISR & DMA_LISR_TCIF2) == DMA_LISR_TCIF2) {  // Полная передача
        _dmax_irq_status[2] &= ~DMAx_IRQ_STATUS_TCIF;
        DMA1_Stream2->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CTCIF2;
    }

    if ((DMA1->LISR & DMA_LISR_HTIF2) == DMA_LISR_HTIF2) {  // Половина передачи
        _dmax_irq_status[2] &= ~DMAx_IRQ_STATUS_HTIF;
        DMA1_Stream2->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CHTIF2;
    }

    if ((DMA1->LISR & DMA_LISR_TEIF2) == DMA_LISR_TEIF2) {  // Ошибка передачи
        _dmax_irq_status[2] &= ~DMAx_IRQ_STATUS_TEIF;
        DMA1_Stream2->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CTEIF2;
    }

    if ((DMA1->LISR & DMA_LISR_DMEIF2) == DMA_LISR_DMEIF2) {  // Ошибка direct-режима
        _dmax_irq_status[2] &= ~DMAx_IRQ_STATUS_DMEIF;
        DMA1_Stream2->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CDMEIF2;
    }

    if ((DMA1->LISR & DMA_LISR_FEIF2) == DMA_LISR_FEIF2) {  // Ошибка FIFO
        _dmax_irq_status[2] &= ~DMAx_IRQ_STATUS_FEIF;
        DMA1_Stream2->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CFEIF2;
    }
}

void DMA1_Stream3_IRQHandler(void) {
    if ((DMA1->LISR & DMA_LISR_TCIF3) == DMA_LISR_TCIF3) {  // Полная передача
        _dmax_irq_status[3] &= ~DMAx_IRQ_STATUS_TCIF;
        DMA1_Stream3->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CTCIF3;
    }

    if ((DMA1->LISR & DMA_LISR_HTIF3) == DMA_LISR_HTIF3) {  // Половина передачи
        _dmax_irq_status[3] &= ~DMAx_IRQ_STATUS_HTIF;
        DMA1_Stream3->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CHTIF3;
    }

    if ((DMA1->LISR & DMA_LISR_TEIF3) == DMA_LISR_TEIF3) {  // Ошибка передачи
        _dmax_irq_status[3] &= ~DMAx_IRQ_STATUS_TEIF;
        DMA1_Stream3->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CTEIF3;
    }

    if ((DMA1->LISR & DMA_LISR_DMEIF3) == DMA_LISR_DMEIF3) {  // Ошибка direct-режима
        _dmax_irq_status[3] &= ~DMAx_IRQ_STATUS_DMEIF;
        DMA1_Stream3->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CDMEIF3;
    }

    if ((DMA1->LISR & DMA_LISR_FEIF3) == DMA_LISR_FEIF3) {  // Ошибка FIFO
        _dmax_irq_status[3] &= ~DMAx_IRQ_STATUS_FEIF;
        DMA1_Stream3->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CFEIF3;
    }
}


void DMA1_Stream4_IRQHandler(void) {
    if ((DMA1->HISR & DMA_HISR_TCIF4) == DMA_HISR_TCIF4) {  // Полная передача
        _dmax_irq_status[4] &= ~DMAx_IRQ_STATUS_TCIF;
        DMA1_Stream4->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CTCIF4;
    }

    if ((DMA1->HISR & DMA_HISR_HTIF4) == DMA_HISR_HTIF4) {  // Половина передачи
        _dmax_irq_status[4] &= ~DMAx_IRQ_STATUS_HTIF;
        DMA1_Stream4->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CHTIF4;
    }

    if ((DMA1->HISR & DMA_HISR_TEIF4) == DMA_HISR_TEIF4) {  // Ошибка передачи
        _dmax_irq_status[4] &= ~DMAx_IRQ_STATUS_TEIF;
        DMA1_Stream4->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CTEIF4;
    }

    if ((DMA1->HISR & DMA_HISR_DMEIF4) == DMA_HISR_DMEIF4) {  // Ошибка direct-режима
        _dmax_irq_status[4] &= ~DMAx_IRQ_STATUS_DMEIF;
        DMA1_Stream4->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CDMEIF4;
    }

    if ((DMA1->HISR & DMA_HISR_FEIF4) == DMA_HISR_FEIF4) {  // Ошибка FIFO
        _dmax_irq_status[4] &= ~DMAx_IRQ_STATUS_FEIF;
        DMA1_Stream4->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CFEIF4;
    }
}

void DMA1_Stream5_IRQHandler(void) {
    if ((DMA1->HISR & DMA_HISR_TCIF5) == DMA_HISR_TCIF5) {  // Полная передача
        _dmax_irq_status[5] &= ~DMAx_IRQ_STATUS_TCIF;
        DMA1_Stream5->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CTCIF5;
    }

    if ((DMA1->HISR & DMA_HISR_HTIF5) == DMA_HISR_HTIF5) {  // Половина передачи
        _dmax_irq_status[5] &= ~DMAx_IRQ_STATUS_HTIF;
        DMA1_Stream5->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CHTIF5;
    }

    if ((DMA1->HISR & DMA_HISR_TEIF5) == DMA_HISR_TEIF5) {  // Ошибка передачи
        _dmax_irq_status[5] &= ~DMAx_IRQ_STATUS_TEIF;
        DMA1_Stream5->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CTEIF5;
    }

    if ((DMA1->HISR & DMA_HISR_DMEIF5) == DMA_HISR_DMEIF5) {  // Ошибка direct-режима
        _dmax_irq_status[5] &= ~DMAx_IRQ_STATUS_DMEIF;
        DMA1_Stream5->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CDMEIF5;
    }

