khosta77/stm32f4_I2C_SSD1306/src/SH_DMA_Sx.h
        if (_DMA_Sx == DMA1_Stream6) {
            _dma_stream = 6;
            _DMA->HIFCR |= (DMA_HIFCR_CTCIF6 | DMA_HIFCR_CHTIF6 | DMA_HIFCR_CTEIF6 | DMA_HIFCR_CDMEIF6 | DMA_HIFCR_CFEIF6);
            NVIC_EnableIRQ(DMA1_Stream6_IRQn);
            NVIC_SetPriority(DMA1_Stream6_IRQn, irq_priority);
        }

        if (_DMA_Sx == DMA1_Stream7) {
            _dma_stream = 7;
            _DMA->HIFCR |= (DMA_HIFCR_CTCIF7 | DMA_HIFCR_CHTIF7 | DMA_HIFCR_CTEIF7 | DMA_HIFCR_CDMEIF7 | DMA_HIFCR_CFEIF7);
            NVIC_EnableIRQ(DMA1_Stream7_IRQn);
            NVIC_SetPriority(DMA1_Stream7_IRQn, irq_priority);
        }

        //// DMA2
        if (_DMA_Sx == DMA2_Stream0) {
            _dma_stream = 8;
            _DMA->LIFCR |= (DMA_LIFCR_CTCIF0 | DMA_LIFCR_CHTIF0 | DMA_LIFCR_CTEIF0 | DMA_LIFCR_CDMEIF0 | DMA_LIFCR_CFEIF0);
            NVIC_EnableIRQ(DMA2_Stream0_IRQn);
            NVIC_SetPriority(DMA2_Stream0_IRQn, irq_priority);
        }
        
        if (_DMA_Sx == DMA2_Stream1) {
            _dma_stream = 9;
            _DMA->LIFCR |= (DMA_LIFCR_CTCIF1 | DMA_LIFCR_CHTIF1 | DMA_LIFCR_CTEIF1 | DMA_LIFCR_CDMEIF1 | DMA_LIFCR_CFEIF1);
            NVIC_EnableIRQ(DMA2_Stream1_IRQn);
            NVIC_SetPriority(DMA2_Stream1_IRQn, irq_priority);
        }
        
        if (_DMA_Sx == DMA2_Stream2) {
            _dma_stream = 10;
            _DMA->LIFCR |= (DMA_LIFCR_CTCIF2 | DMA_LIFCR_CHTIF2 | DMA_LIFCR_CTEIF2 | DMA_LIFCR_CDMEIF2 | DMA_LIFCR_CFEIF2);
            NVIC_EnableIRQ(DMA2_Stream2_IRQn);
            NVIC_SetPriority(DMA2_Stream2_IRQn, irq_priority);
        }
        
        if (_DMA_Sx == DMA2_Stream3) {
            _dma_stream = 11;
            _DMA->LIFCR |= (DMA_LIFCR_CTCIF3 | DMA_LIFCR_CHTIF3 | DMA_LIFCR_CTEIF3 | DMA_LIFCR_CDMEIF3 | DMA_LIFCR_CFEIF3);
            NVIC_EnableIRQ(DMA2_Stream3_IRQn);
            NVIC_SetPriority(DMA2_Stream3_IRQn, irq_priority);
        }
        
        if (_DMA_Sx == DMA2_Stream4) {
            _dma_stream = 12;
            _DMA->HIFCR |= (DMA_HIFCR_CTCIF4 | DMA_HIFCR_CHTIF4 | DMA_HIFCR_CTEIF4 | DMA_HIFCR_CDMEIF4 | DMA_HIFCR_CFEIF4);
            NVIC_EnableIRQ(DMA2_Stream4_IRQn);
            NVIC_SetPriority(DMA2_Stream4_IRQn, irq_priority);
        }
        
        if (_DMA_Sx == DMA2_Stream5) {
            _dma_stream = 13;
            _DMA->HIFCR |= (DMA_HIFCR_CTCIF5 | DMA_HIFCR_CHTIF5 | DMA_HIFCR_CTEIF5 | DMA_HIFCR_CDMEIF5 | DMA_HIFCR_CFEIF5);
            NVIC_EnableIRQ(DMA2_Stream5_IRQn);
            NVIC_SetPriority(DMA2_Stream5_IRQn, irq_priority);
        }

        if (_DMA_Sx == DMA2_Stream6) {
            _dma_stream = 14;
            _DMA->HIFCR |= (DMA_HIFCR_CTCIF6 | DMA_HIFCR_CHTIF6 | DMA_HIFCR_CTEIF6 | DMA_HIFCR_CDMEIF6 | DMA_HIFCR_CFEIF6);
            NVIC_EnableIRQ(DMA2_Stream6_IRQn);
            NVIC_SetPriority(DMA2_Stream6_IRQn, irq_priority);
        }

        if (_DMA_Sx == DMA2_Stream7) {
            _dma_stream = 15;
            _DMA->HIFCR |= (DMA_HIFCR_CTCIF7 | DMA_HIFCR_CHTIF7 | DMA_HIFCR_CTEIF7 | DMA_HIFCR_CDMEIF7 | DMA_HIFCR_CFEIF7);
            NVIC_EnableIRQ(DMA2_Stream7_IRQn);
            NVIC_SetPriority(DMA2_Stream7_IRQn, irq_priority);
        }
    }
public:
    A *_array_0;
    A *_array_1;

    SH_DMA_Sx(DMA_Stream_TypeDef *DMA_Sx,
              P *periphery,
              const uint32_t &options_cr,
              A *array_0,
              A *array_1,
              const uint8_t &irq_priority
              ) : _DMA_Sx(DMA_Sx), _periphery(periphery), _options_cr(options_cr),
                  _array_0(array_0), _array_1(array_1)
    {
        uint8_t status = 0x00;

        // Включаем тактирование, назначаем внутреннеию переменную _DMA
        _dmax_init();

        // Отключаем DMA, для настройки
        _DMA_Sx->CR &= ~DMA_SxCR_EN;
        while ((_DMA_Sx->CR) & DMA_SxCR_EN){;}

        // Настройка DMA по документаци
        _DMA_Sx->CR = _options_cr;

        // Задаем потоки передачи/приема
        _DMA_Sx->PAR = (uint32_t)&_periphery->DR;
        _DMA_Sx->M0AR = (uint32_t)_array_0;
        _DMA_Sx->M1AR = (uint32_t)_array_1;
        //_DMA_Sx->NDTR = _size;

        // Инициализируем прирывания
        _iqr_dma_sx_init(irq_priority);
    }

private:
    void fuller_array(A *_array, const A *pBuffer, const uint16_t &_size) {
        for (uint32_t i = 0; i < _size; ++i) {
            _array[i] = pBuffer[i];
        }
    }

public:
    void dma_transmit(const A *pBuffer, const uint16_t &_size) {
        if(pBuffer != nullptr) {
            // Ждем/проверяем пока передача не закончится
            while ((_dmax_irq_status[_dma_stream] & DMAx_IRQ_STATUS_TCIF) == DMAx_IRQ_STATUS_TCIF) {;}

            // Отключаем DMA
            _DMA_Sx->CR &= ~DMA_SxCR_EN;
            while ((_DMA_Sx->CR) & DMA_SxCR_EN){;}

            // Выбираем и заполняем массив
            if ((_dmax_irq_status[_dma_stream] & DMAx_IRQ_STATUS_CT) == DMAx_IRQ_STATUS_CT) {
                _DMA_Sx->CR &= ~DMA_SxCR_CT;
                _dmax_irq_status[_dma_stream] &= ~DMAx_IRQ_STATUS_CT;
                fuller_array(_array_0, pBuffer, _size);
            } else {
                _DMA_Sx->CR |= DMA_SxCR_CT;
                _dmax_irq_status[_dma_stream] |= DMAx_IRQ_STATUS_CT;
                fuller_array(_array_1, pBuffer, _size);
            }

            // Выставляем маркер начала передачи.
            _dmax_irq_status[_dma_stream] |= DMAx_IRQ_STATUS_TCIF;
            _DMA_Sx->NDTR = _size;
            _DMA_Sx->CR |= DMA_SxCR_MINC;

            // Запускаем передачу
            _DMA_Sx->CR |= DMA_SxCR_EN;
        } else {
            /* Нулевой массив */
        }
    }

    void dma_receive(const uint16_t &_size) {
        // Ждем/проверяем пока передача не закончится
        while ((_dmax_irq_status[_dma_stream] & DMAx_IRQ_STATUS_TCIF) == DMAx_IRQ_STATUS_TCIF) {;}
            GPIOD->ODR |= GPIO_ODR_OD14;

        // Отключаем DMA
        _DMA_Sx->CR &= ~DMA_SxCR_EN;
        while ((_DMA_Sx->CR) & DMA_SxCR_EN){;}

        // Выбираем и заполняем массив
        if ((_dmax_irq_status[_dma_stream] & DMAx_IRQ_STATUS_CT) == DMAx_IRQ_STATUS_CT) {
            _DMA_Sx->CR &= ~DMA_SxCR_CT;
            _dmax_irq_status[_dma_stream] &= ~DMAx_IRQ_STATUS_CT;
        } else {
            _DMA_Sx->CR |= DMA_SxCR_CT;
            _dmax_irq_status[_dma_stream] |= DMAx_IRQ_STATUS_CT;
        }

        // Выставляем маркер начала передачи.
        _dmax_irq_status[_dma_stream] |= DMAx_IRQ_STATUS_TCIF;
        _DMA_Sx->NDTR = _size;
        _DMA_Sx->CR |= DMA_SxCR_MINC;  // Не уверен надо ли это при приеме

        // Запускаем прием
        _DMA_Sx->CR |= DMA_SxCR_EN;
    }

    A *dma_receive_read() {
        // Ждем/проверяем пока передача не закончится
        while ((_dmax_irq_status[_dma_stream] & DMAx_IRQ_STATUS_TCIF) == DMAx_IRQ_STATUS_TCIF) {;}

        // Отключаем DMA
        _DMA_Sx->CR &= ~DMA_SxCR_EN;
        while ((_DMA_Sx->CR) & DMA_SxCR_EN){;}

        // Возвращаем заполненный массив
        if ((_dmax_irq_status[_dma_stream] & DMAx_IRQ_STATUS_CT) == DMAx_IRQ_STATUS_CT)
            return _array_1;
        else
            return _array_0;

        // Если происходит что-то изряда вон выходящее, возвращаем ноль.
        return nullptr;
    }

    inline const uint8_t _is_work() {
        return ((_dmax_irq_status[_dma_stream] & DMAx_IRQ_STATUS_TCIF) == DMAx_IRQ_STATUS_TCIF);
    }

    /* Черт возможно что то пошло не так и из програмы мы это понимаем, надо руками выключить все.
     * */
    void _not_plan_stop() {
        // Отключаем передачу
        _dmax_irq_status[_dma_stream] &= ~DMAx_IRQ_STATUS_TCIF;
        
        // Отключаем DMA
        _DMA_Sx->CR &= ~DMA_SxCR_EN;
        while ((_DMA_Sx->CR) & DMA_SxCR_EN){;}
    }
};

#endif  // STEPAN_HAL_DMA_STREAMX_H_
